# tap
tap "homebrew/bundle"
tap "homebrew/services"
tap "cloudflare/cloudflare"
tap "coursier/formulas"
tap "suzuki-shunsuke/ghalint"
tap "suzuki-shunsuke/pinact"

# brew
brew "coursier/formulas/coursier"
brew "suzuki-shunsuke/ghalint/ghalint"
brew "suzuki-shunsuke/pinact/pinact"
brew "act"
brew "actionlint"
brew "bat"
brew "chezmoi"
brew "cloudflared"
brew "cmake"
brew "cpanminus"
brew "eza"
brew "fastfetch"
brew "fd"
brew "fzf"
brew "gcc"
brew "gh"
brew "git"
brew "git-delta"
brew "git-lfs"
brew "go-task"
brew "gzip"
brew "hadolint"
brew "jq"
brew "latexindent"
brew "lazygit"
brew "libyaml"
brew "mise"
brew "perl"
brew "sheldon"
brew "shellcheck"
brew "shfmt"
brew "sl"
brew "unzip"
brew "xz"
brew "zoxide"
{{ if eq .chezmoi.os "linux" }}
# zsh
brew "zsh"
{{ end }}

{{ if eq .chezmoi.os "darwin" }}
# cask
cask "1password"
cask "1password-cli"
cask "alt-tab"
cask "appcleaner"
cask "arc"
cask "docker"
cask "figma"
cask "font-fira-code"
cask "font-meslo-for-powerlevel10k"
cask "font-noto-sans-jp"
cask "google-chrome"
cask "google-japanese-ime"
cask "hhkb"
cask "hiddenbar"
cask "httpie"
cask "linearmouse"
cask "notchnook"
cask "raycast"
cask "slack"
cask "spotify"
cask "warp"
cask "visual-studio-code"
cask "zoom"
{{ if .for_personal }}
# for personal mac only
cask "anydesk"
cask "cyberduck"
cask "discord"
cask "mactex-no-gui"
cask "notion"
cask "prismlauncher"
cask "readdle-spark"
cask "tailscale"
{{ end }}
{{ end }}
