# tap
tap "homebrew/bundle"
tap "homebrew/services"
tap "buo/cask-upgrade"
tap "caarlos0/tap"
tap "cloudflare/cloudflare"
tap "f/mcptools"
tap "goreleaser/tap"
tap "kayac/tap"
tap "sushichan044/tap"
tap "suzuki-shunsuke/ghalint"
tap "suzuki-shunsuke/pinact"

# brew
# from custom tap
brew "caarlos0/tap/svu"
brew "f/mcptools/mcp"
brew "kayac/tap/ecspresso"
brew "goreleaser/tap/goreleaser"
brew "sushichan044/tap/ajisai"
brew "suzuki-shunsuke/ghalint/ghalint"
brew "suzuki-shunsuke/pinact/pinact"

brew "act"
brew "actionlint"
brew "ast-grep"
brew "autoconf"
brew "bat"
brew "chezmoi"
brew "cloudflared"
brew "cmake"
brew "cpanminus"
brew "cppcheck"
brew "cpplint"
brew "devcontainer"
brew "direnv"
brew "duckdb"
brew "eza"
brew "fastfetch"
brew "fd"
brew "ffmpeg"
brew "flawfinder"
brew "fzf"
brew "gcc"
brew "gh"
brew "ghq"
brew "git"
brew "git-branchless"
brew "git-delta"
brew "git-lfs"
brew "go-task"
brew "golangci-lint"
brew "gzip"
brew "hadolint"
brew "httpie"
brew "imagemagick"
brew "jq"
brew "jsonnet"
brew "latexindent"
brew "lazygit"
brew "libyaml"
brew "lizard-analyzer"
brew "mise"
brew "peco"
brew "perl"
brew "postgresql@14"
brew "ripgrep"
brew "sheldon"
brew "shellcheck"
brew "shfmt"
brew "sl"
brew "tokei"
brew "unzip"
brew "xz"
brew "zoxide"

# Linux only
if OS.linux?
    brew "zsh"
end

if OS.mac?
    # GNU tools
    brew "coreutils"
    brew "gnu-sed"

    # cask
    cask "1password-cli"
    cask "alt-tab"
    cask "appcleaner"
    cask "arc"
    cask "battery"
    cask "coconutbattery"
    cask "cursor"
    cask "deskpad"
    cask "discord"
    cask "docker"
    cask "figma"
    cask "ghostty"
    cask "google-japanese-ime"
    cask "hhkb"
    cask "httpie"
    cask "jetbrains-toolbox"
    cask "jordanbaird-ice"
    cask "karabiner-elements"
    cask "linearmouse"
    cask "mongodb-compass"
    cask "neohtop"
    cask "notchnook"
    cask "notion"
    cask "raycast"
    cask "spotify"
    cask "visual-studio-code"
    cask "wezterm@nightly"
    cask "xcodes"
    cask "zoom"
    # fonts
    cask "font-fira-code"
    cask "font-meslo-for-powerlevel10k"
    cask "font-moralerspace"
    cask "font-moralerspace-nf"
    cask "font-noto-sans-jp"
{{ if .for_personal }}
    # for personal mac only
    cask "1password"
    cask "anydesk"
    cask "cyberduck"
    cask "gimp"
    cask "google-chrome"
    cask "mactex-no-gui"
    cask "prismlauncher"
    cask "readdle-spark"
    cask "slack"
    cask "tailscale"
{{ end }}
end

{{ if not .for_personal }}
{{ (onepasswordDetailsFields "j42vpfiovjdirqy6xq6hlax34m").notesPlain.value }}
{{ end }}
